Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/travel_abroad/passports/renewing_an_irish_passport.html.txt.tmx
Source language: en
Languages: ga

source: Renewing an Irish passport
ga: Pas Éireannach a athnuachan

source: A passport is an internationally recognised travel document confirming your identity and nationality and you are only entitled to an Irish passport if you are an Irish citizen
ga: Is é is pas ann ná cáipéis taistil a aithnítear go hidirnáisiúnta a dheimhníonn d’aitheantas agus do náisiúntacht agus ní bheidh tú i dteideal pas Éireannach ach amháin más saoránach Éireannach thú

source: This document explains how to renew your Irish passport when you have your old Irish passport
ga: Tugtar míniú sa doiciméad seo ar conas do phas Éireannach a athnuachan nuair atá pas Éireannach agat

source: Since 30 March 2017, it is possible to do this online
ga: Gheobhaidh tú faisnéis i ndoiciméid eile faoi na nithe seo:

source: • Applying for your first Irish passport
ga: • Iarratas a dhéanamh ar do chead phas Éireannach

source: • Replacing a lost or stolen passport
ga: • Pas caillte nó goidte a athsholáthar

source: If your most recent passport expired more than 5 years ago, you should read the document on applying for your first Irish passport
ga: Má ghlactar le d'phas is deireanaí éag níos mó ná 5 bliana ó shin, ba chóir duit an doiciméad a léamh faoi iarratas a dhéanamh ar do chéad phas Éireannach

source: Your passport is an important legal document
ga: Cáipéis dlí thábhachtach is ea do phas

source: At all times, you should ensure that it is kept in a secure place
ga: Ba cheart duit a chinntiú go bhfuil sé á choimeád in áit shábháilte i gcónaí

source: Each Irish passport carries a unique identification number and you should keep a note of your number, in the event that your passport is lost or stolen
ga: Tá uimhir aitheantais uathúil ag gach pas Éireannach agus ba cheart duit d'uimhir a nótáil, sa chás go gcailltear nó go ngoidtear do phas

source: Your Irish passport is issued by the Irish Government through the Passport Service of the Department of Foreign Affairs and Trade here in Ireland
ga: Eisíonn Rialtas na hÉireann do phas Éireannach tríd an tSeirbhís Pasanna sa Roinn Gnóthaí Eachtracha agus Trádála anseo in Éirinn

source: Irish passports are also issued through Irish embassies and consulates throughout the world, to whom you apply if you are living abroad
ga: Chomh maith leis sin, eisítear pasanna Éireannacha trí ambasáidí Éireannacha agus trí chonsalachtaí Éireannacha ar fud na cruinne

source: Irish citizens travelling to destinations outside the EU are subject to the specific passport controls and requirements of those countries
ga: Tá saoránaigh Éireannacha atá ag taisteal chuig áiteanna taobh amuigh den AE faoi réir shrianta pas agus cheanglais ar leith na dtíortha sin

source: This means, for example, when travelling outside the EU, your passport may need to be valid for a certain period
ga: Ciallaíonn sé sin, mar shampla, gur féidir go bhfuil sé riachtanach go bhfuil do phas bailí ar feadh tréimhse ar leith agus tú ag taisteal taobh amuigh den AE

source: The arrangements vary from one country to another, so contact the embassy of the relevant country before you travel for the most up-to-date information on these requirements
ga: Bíonn na socrúcháin éagsúil ó thír go tír. Mar sin de, déan teagmháil le hambasáid na tíre lena mbaineann sula dtaistealaíonn tú chun an fhaisnéis is déanaí a fháil maidir leis na ceanglais sin

source: All EU citizens have the right to enter and live in the territory of another member state of the EU for up to 3 months
ga: Tá an ceart ag gach saoránach den AE dul isteach i gcríoch ballstáit eile den AE agus cónaí a bheith orthu ann ar feadh 3 mhí ar a mhéad

source: You simply present a valid passport or national identity card; no other formality is required
ga: Níl le déanamh ach pas bailí nó cárta aitheantais náisiúnta bailí a thaispeáint; ní theastaíonn aon fhoirmiúlacht eile

source: EU countries cannot set additional conditions concerning the minimum validity or duration of the identity card or passport
ga: Ní féidir le tíortha den AE coinníollacha breise a shocrú maidir le híosbhailíocht ná le híosfhad an chárta aitheantais nó an phas

source: Basically this means that your passport doesn't have to be valid for, say, 6 months before you are allowed enter another EU country
ga: Go bunúsach, ciallaíonn sé sin nach bhfuil sé riachtanach do phas a bheith bailí ar feadh 6 mhí, mar shampla, sula mbíonn cead agat dul isteach i dtír eile den AE

source: A machine-readable passport is a passport with 2 typeface lines printed at the bottom of the biographical page , which can be read by machine
ga: Is é is pas inléite ag meaisín ann ná pas ag a bhfuil 2 líne chló-aghaidhe priontáilte ag bun an leathanaigh bheathaisnéisigh ar féidir le meaisín iad a léamh

source: When read, these lines electronically provide identical information to that provided on the biographical page
ga: Nuair a léitear iad, soláthraíonn na línte sin go leictreonach faisnéis atá ar aon dul leis an bhfaisnéis atá ar an leathanach beathaisnéiseach

source: In October 2006 the Passport Office began issuing Irish electronic passports (ePassport)
ga: I mí Dheireadh Fómhair 2006, chuir Oifig na bPasanna tús le ríomhphasanna Éireannacha (r-Phas) a eisiúint

source: An electronic passport is the same as a normal machine-readable passport with the addition of a small integrated circuit or chip embedded in the photo page
ga: Is ionann ríomhphas agus gnáthphas atá inléite ag meaisín agus cuirtear ciorcad comhtháite beag nó slis atá istigh sa leathanach grianghraif leis

source: The chip securely stores a digitised image of the photo and personal details of the passport holder as they appear on the data page of the passport, which allows the use of facial recognition technology at border controls
ga: Déanann an tslis stóráil ar íomhá dhigitithe den ghrianghraf agus ar shonraí pearsanta shealbhóir an phas mar atá siad ar leathanach sonraí an phas. Tríd sin, is féidir úsáid a bhaint as teicneolaíocht aghaidh-aitheanta ag rialuithe teorann

source: You can renew your passport at any time
ga: Is féidir leat do phas a athnuachan am ar bith

source: If you apply for a new passport before your current one has expired, your new passport will run from when you apply
ga: Más féidir leat iarratas a dhéanamh ar phas sula bhfuil do phas reatha in éag, beidh do phas nua i bhfeidhm ón dáta ar a ndéanann tú iarratas

source: The Department of Foreign Affairs and Trade provides a Passport Reminder Service which sends you a reminder by email 3 months before your passport is due to expire
ga: Soláthraíonn an Roinn Gnóthaí Eachtracha agus Trádála Seirbhís Meabhrúcháin Phas, a sheolann meabhrúchán chugat trí r-phost 3 mhí sula bhfuil do phas le dul in éag

source: You must register for this service
ga: Ní mór duit clárú le haghaidh na seirbhíse sin

source: If you want to change the name on your passport, for example, if you have married, you have to renew your passport
ga: Más maith leat an t-ainm ar do phas a athrú, mar shampla, má phós tú, caithfidh tú do phas a athnuachan

source: You must be an Irish citizen in order to be eligible for an Irish passport
ga: Ní mór duit a bheith i do shaoránach Éireannach le bheith i dteideal pas Éireannach

source: You have a right to apply for a passport if you are aged 18 years or over
ga: Beidh an ceart agat chun iarratas a dhéanamh ar phas má tá tú 18 mbliana d’aois nó níos sine

source: If you are under 18, you will need the consent of both parents or guardian(s) in writing in order to get your own passport - see our document on passports for children
ga: Má tá tú faoi bhun 18 mbliana d’aois, teastóidh cead uait ó do bheirt tuismitheoirí nó chaomhnóirí i scríbhinn le go mbeidh tú in ann do phas féin a fháil - féach ár ndoiciméad maidir le pasanna do leanaí

source: Titles such as Mr, Mrs, Ms, Dr, Rev., Sir, Lord, Lady are not entered on Irish passports
ga: Ní chuirtear teidil amhail Uas., Bn, Dr, Urram., Ridire, Tiarna, Bantiarna ar phasanna Éireannacha

source: If the name on your passport will not be exactly the same as the name on your birth certificate, you can indicate on the application form that you also want your birth certificate name noted on the passport
ga: Murab ionann go díreach an t-ainm ar do phas agus an t-ainm ar do theastas breithe, féadfaidh tú a chur in iúl ar an bhfoirm iarratais gur mian leat an t-ainm ar do theastas breithe a nótáil ar an bpas

source: This can help to avoid difficulties if you apply for a visa or work permit abroad
ga: Féadann sé sin cabhrú le deacrachtaí a sheachaint má dhéanann tú iarratas ar víosa nó ar chead oibre thar lear

source: If you are applying online, you will need to provide a digital photo. There are 3 ways to do this – see these detailed photo guidelines on dfa.ie
ga: Ní mór ceithre ghrianghraf chomhionanna a tógadh le déanaí de shealbhóir an phas a chur san áireamh le gach iarratas

source: For each paper application, 4 recent identical photographs of the passport holder must be included
ga: Ba cheart dhá cheann díobh a bheith sínithe ar an gcúl ag an duine a fhianaíonn an t-iarratas

source: The witness should also write the form number shown in Section 9 of the application form on those 2 photographs
ga: Ba cheart don fhinné an uimhir foirme a thaispeántar i gCuid 9 den fhoirm iarratais a scríobh ar an 2 ghrianghraf sin

source: If you are applying in Ireland the witness must be a member of the Garda Síochána
ga: Más rud é go bhfuil iarratas á dhéanamh agat in Éirinn, caithfidh an finné a bheith ina bhall/ball den Gharda Síochána

source: If you are applying abroad, suitable categories of witness are listed on the application form
ga: Más rud é go bhfuil iarratas á dhéanamh agat thar lear, tá catagóirí d’fhinnéithe liostaithe ar an bhfoirm iarratais

source: The witness should enter their daytime contact number on the application form as this may need to be verified by the Passport Office or Mission
ga: Ba cheart don fhinné a (h)uimhir theagmhála lae a chur isteach ar an bhfoirm iarratais mar gur féidir go mbeidh ar Oifig na bPasanna nó ar Mhisean iad a fhíorú

source: More detailed information on passport photographs is available here
ga: Tá faisnéis níos mine faoi ghrianghraif phas ar fáil anseo

source: The fees when applying for an Irish passport using An Post's Passport Express (see below) or through an embassy or consulate are:
ga: Is mar seo a leanas atá na táillí i bhfeidhm agus iarratas á dhéanamh ar phas Éireannach ach úsáid as Seirbhís na bPasanna Luais de chuid An Post (féach thíos) nó trí ambasáid nó trí chonsalacht:

source: • Standard 10-year 34-page passport (aged 18 and over): €80
ga: • Gnáthphas 10 mbliana ina bhfuil 32 leathanach (18 mbliana agus níos sine): €80

source: • Large 10-year 66-page passport (aged 18 and over): €110
ga: • Pas mór 10 mbliana ina bhfuil 66 leathanach (18 mbliana agus níos sine): €110

source: These fees do not include the charge for using the Passport Express service
ga: Ní áiríonn na táillí an muirear le haghaidh úsáid an tseirbhís na bPasanna Luais

source: When applying in person at a Passport Office the fees are:
ga: Nuair atáthar ag déanamh iarratas ar phas go pearsanta ag Oifig na bPasanna, tá na táillí mar seo a leanas:

source: • Standard 10-year, 34-page passport (aged 18 and over): €95
ga: • Gnáthphas 10 mbliana ina bhfuil 32 leathanach (18 mbliana agus níos sine): €95

source: • Large 10-year 66-page passport (aged 18 and over): €125
ga: • Pas mór 10 mbliana ina bhfuil 66 leathanach (18 mbliana agus níos sine): €125

source: Emergency charge: There is an additional charge of €70 if you require your adult passport urgently (within 3 to 5 working days)
ga: Muirear éigeandála: Gearrfar táille bhreise €55 ort má theastaíonn do phas fásta uait go práinneach (laistigh de 5 lá oibre)

source: If you use An Post's Passport Express service there will be an additional charge of €9.50 per application, payable to An Post
ga: Gearrfar táille bhreise €9.50 san iarratas ort má úsáideann tú Seirbhís na bPasanna Luais de chuid An Post

source: An Post also offers a 'Family Application' option whereby up to 4 passport applications may be enclosed in one envelope
ga: Chomh maith leis sin, tairgeann An Post rogha ‘Iarratas Teaghlaigh’ trínar féidir 4 iarratas ar phas ar a mhéad do theaghlach a iamh i gclúdach amháin

source: The additional charge for a Family Application is €16
ga: Is é €16 an táille bhreise ar Iarratas Teaghlaigh

source: The additional charge includes postage to and from the Passport Service
ga: Folaíonn an táille bhreise postas chuig an tSeirbhís Pasanna agus amach uaithi

source: The Passport Express service is also available through UK Post Office branches in Northern Ireland (pdf)
ga: Tá Sheirbhís na bPasanna Luais ar fáil trí bhrainsí Oifig Phoist na Ríochta Aontaithe i dTuaisceart Éireann (pdf) freisin

source: When applying for a passport through your Irish embassy or consulate, there may be additional administrative costs or handling charges depending on where you live
ga: Más rud é go bhfuil tú ag cur isteach ar phas trí d'ambasáid Éireannach nó do chonsalacht Éireannach, d’fhéadfadh costais bhreise riaracháin nó táille láimhseála a bheith i gceist, ag brath ar an áit ina bhfuil cónaí ort

source: Check this in advance with the Irish embassy or consulate in the country in which you are living
ga: Déan é seo a chinntiú roimh ré leis an ambasáid Éireannach nó leis an gconsalacht Éireannach sa tír ina bhfuil cónaí ort

source: If you are not renewing online, you can pay for your Irish passport through Passport Express or at a Passport Office public counter if you are living in Ireland
ga: Féadfaidh tú íoc as do phas Éireannach trí Sheirbhís na bPasanna Luais nó trí chuntar poiblí de chuid Oifig na bPasanna má tá cónaí ort in Éirinn

source: If you are using An Post's Passport Express service, you should pay the passport application fees and the extra Passport Express fee directly to An Post
ga: Más rud é go bhfuil Seirbhís na bPasanna Luais de chuid An Post á húsáid agat, ba cheart duit na táillí iarratais ar phas agus táille bhreise Sheirbhís na bPasanna Luais a íoc go díreach le An Post

source: If you are living abroad, you can pay by post or at your nearest Irish embassy or consulate abroad
ga: Más rud é go bhfuil cónaí ort thar lear, féadfaidh tú íoc as tríd an post nó tríd an ambasáid Éireannach nó tríd an gconsalacht Éireannach is cóngaraí duit thar lear

source: You can renew an Irish passport online, following the step-by-step instructions provided. Paper applications
ga: Ní féidir ach oiread an fhoirm iarratais nach mór duit a chomhlánú a íoslódáil faoi láthair

source: If you are living in Ireland, you can apply using Passport Express or in person at a Passport Office
ga: Más rud é go bhfuil cónaí ort in Éirinn, féadfaidh tú iarratas a dhéanamh ach úsáid a bhaint as Seirbhís na bPasanna Luais nó go pearsanta ag oifig d’Oifig na bPasanna

source: If you are living abroad you can apply in person or using ordinary or registered post to your nearest Irish embassy or consulate
ga: Má tá cónaí ort thar lear, féadfaidh tú iarratas a dhéanamh go pearsanta nó gnáthphost nó post cláraithe a úsáid ag an ambasáid Éireannach nó ag an gconsalacht Éireannach is cóngaraí duit

source: If you are an Irish citizen living in the State, you should fill out form APS 1
ga: Más saoránach Éireannach thú ar a bhfuil cónaí sa Stát, ba cheart duit foirm APS 1 a chomhlánú

source: You will find these forms at Garda stations and at any Post Office
ga: Gheobhaidh tú na foirmeacha sin ag stáisiúin na nGardaí agus ag aon Oifig Phoist

source: If you are an Irish citizen living in Northern Ireland or outside Ireland you should fill out form APS 2
ga: Más saoránach Éireannach thú ar a bhfuil cónaí i dTuaisceart Éireann nó lasmuigh d’Éirinn, ba cheart duit foirm APS 2 a chomhlánú

source: You can get the application form from the Irish embassy or consulate in the country where you live (or the closest embassy or consulate)
ga: Is féidir leat an fhoirm iarratais a fháil ón ambasáid Éireannach nó ón gconsalacht Éireannach sa tír ina bhfuil cónaí ort (nó ón ambasáid nó ón gconsalacht is cóngaraí duit)

source: The Passport Express service including forms is available through certain UK Post Office branches in Northern Ireland (pdf). It is not currently possible to download the application form
ga: Tá Seirbhís na bPasanna Luais, lena n-áirítear foirmeacha, ar fáil trí bhrainsí áirithe d’Oifig Phoist na Ríochta Aontaithe i dTuaisceart Éireann (pdf)

source: When you get the form, you should read the detailed notes provided with it, to help you complete your application correctly
ga: Tar éis duit an fhoirm a fháil, ba cheart duit na nótaí mionsonraithe a chuirtear ar fáil léi a léamh chun cabhrú leat d’iarratas a chomhlánú i gceart

source: The application form must be signed by an official witness who can confirm your identity and the details you have given
ga: Ní mór an fhoirm iarratais a bheith sínithe ag finné oifigiúil a fhéadann d’aitheantas agus na sonraí a thug tú a dheimhniú

source: If you are renewing your Irish passport online, you will need to provide a digital photo of yourself - see these detailed photo guidelines on dfa.ie
ga: I ngach iarratas ar phas Éireannach a athnuachan, ní mór duit na nithe seo a leanas a chur isteach i dteannta na foirme iarratais comhlánaithe:

source: • Four photographs, 2 of which must be signed by a witness as per instructions provided with the application form
ga: • Ceithre ghrianghraf, a bhfuil 2 cheann díobh sínithe ag finné de réir na dtreoracha a chuirtear ar fáil leis an bhfoirm iarratais

source: • Your current or most recent passport
ga: • Do phas reatha nó is déanaí eisiúint

source: If your current passport is valid for less than 6 more months, a copy of the passport will be accepted
ga: Más bailí ar feadh níos lú ná 6 mhí eile atá do phas reatha, glacfar le cóip den phas

source: (If you are renewing your passport and making no changes, you need only submit your most recent Irish passport)
ga: (Má tá tú ag déanamh athnuachana ar do phas agus gan aon athrú á dhéanamh agat air, ní gá duit ach do phas Éireannach is déanaí a chur isteach)

source: If you are renewing a child’s passport which has been issued since January 2005, you may not need to submit the child's birth certificate
ga: Má tá pas linbh á athnuachan, a eisíodh ó Eanáir 2005 i leith, b'fhéidir nach bhfuil gá duit an teastas breithe a sheoladh ar aghaidh

source: Find out more in our document on passports for children
ga: Faigh amach tuilleadh inár gcáipéis ar phasanna do leanaí

source: If you want to change the name on your passport to your married or civil partnership name you must submit your civil marriage certificate or civil partnership certificate
ga: Más mian leat an t-ainm ar do phas a athrú chuig d’ainm pósta nó d’ainm páirtnéireachta sibhialta, caithfidh tú do theastas pósta shibhialta nó do theastas páirtnéireachta sibhialta a chur isteach

source: If your previous passport was issued in your married name and you want your new passport issued in your maiden name you must submit your birth certificate and your judicial separation court order, your separation agreement or your divorce decree
ga: Más rud é gur eisíodh do phas roimhe i d’ainm pósta agus gur mian leat go n-eiseofar do phas nua i d’ainm roimh phósadh, caithfidh tú do theastas breise agus d’ordú cúirte um idirscaradh breithiúnach nó do chomhaontú idirscartha nó d’fhoraithne colscartha a chur isteach

source: Otherwise, you will need to submit 2 official documents that show you've been using your maiden name for 2 years
ga: Murach sin, caithfidh tú 2 dhoiciméad oifigiúla a chur isteach a thaispeánann go bhfuil d’ainm roimh phósadh in úsáid agat le 2 bhliain anuas

source: If the name you are known by is different from the name on your most recent passport and it is not due to marriage, civil partnership or adoption, you will have to submit documentary evidence that you have been continually using the name for at least 2 years
ga: Murab ionann an t-ainm a thugtar ort agus an t-ainm ar do phas is déanaí agus ní hamhlaidh sin de bharr pósta, páirtnéireachta sibhialta nó uchtú, beidh ort fianaise dhoiciméadach a chur isteach a dhearbhaíonn go bhfuil an t-ainm in úsáid agat ar feadh 2 bhliain ar a laghad

source: If the name you are known by is the Irish version of your name but you do not have proof of 2 years’ usage, proof of at least 6 months’ usage may be accepted
ga: Má tá tú ar eolas ag an leagan Gaeilge de d'ainm ach ní gá duit cruthúnas 2 bhliain 'úsáide, cruthúnas ar a laghad 6 mhí úsáide féadfar glacadh

source: If the proof of 6 months’ usage is accepted, the English version of your name will also be noted on the passport
ga: Má tá an cruthúnas úsáide 6 mhí glacadh leis, beidh an leagan Béarla d'ainm a thabhairt faoi deara freisin ar an bpas

source: Examples of documentation showing proof of usage include a driving licence, bank statements, insurance, tax and social welfare documents
ga: Áirítear le samplaí den doiciméadúchán sin ceadúnas tiomána, ráitis bhainc, árachas, cáin agus doiciméid leasa shóisialaigh

source: You should include at least 2 examples with your application
ga: Ba cheart duit 2 shampla ar a laghad a chur le d’iarratas

source: If your documents are not in English you must also supply a certified English version, translated by a registered translator
ga: Mura bhfuil do chuid doiciméad i mBéarla, caithfidh tú leagan deimhnithe Béarla arna aistriú ag aistritheoir cláraithe a sholáthar

source: Processing times for Irish passports
ga: Amanna próiseála do phasanna Éireannacha

source: The Passport Service strongly recommends that you apply for your passport at least 6 weeks prior to your travel date
ga: Molann an tSeirbhís Pas láidir go bhfuil tú iarratas a dhéanamh ar do phas ar a laghad 6 seachtaine roimh do dháta taistil

source: Applying through the Passport Express service ensures that properly completed renewal applications will be processed in 15 working days
ga: Trí iarratas a dhéanamh trí Sheirbhís na bPasanna Luais, cinntíonn sé go bpróiseálfar iarratais athnuachan chomhlánaithe laistigh de 15 lá oibre

source: This period may be extended at certain times of the year due to increased application numbers
ga: D’fhéadfadh go sínfí an tréimhse sin ag tráthanna áirithe sa bhliain mar thoradh ar líon méadaithe iarratas

source: Check the Passport Service website for current processing time information
ga: Seiceáil láithreán Gréasáin na Seirbhíse Pasanna le haghaidh na faisnéise reatha faoi am próiseála

source: If you are due to travel in less than 3 weeks you should apply in person to a Passport Office
ga: Ba cheart duit iarratas a dhéanamh go pearsanta chuig ceann ar bith d’Oifigí na bPasanna sa chás go mbeidh tú ag taisteal laistigh de 3 seachtaine

source: To apply in person at a Passport Office, you should book an appointment online
ga: D’fhonn iarratas a dhéanamh go pearsanta chuig ceann ar bith d’Oifigí na bPasanna, ba cheart duit coinne a chur in áirithe ar líne

source: If you require a passport urgently, you should contact the Passport Service
ga: Más rud é go dteastaíonn pas uait go práinneach, ba cheart duit dul i dteagmháil leis an tSeirbhís Pasanna

source: If living abroad, in general you should allow at least 6-8 weeks for the processing of your passport via your local embassy or consulate
ga: Má tá cónaí ort thar lear, ba cheart duit 6-8 seachtaine ar a laghad a fhágáil le haghaidh phróiseáil d’iarratais tríd an ambasáid nó tríd an gconsalacht is cóngaraí duit

source: Tracking the progress of your passport application
ga: An dul chun cinn ar d’iarratas ar phas a rianú
